# Assigment 7

### Data

In [5]:
# Import libraries
import pandas as pd
import sys

### 1. Load the ratings by user information that you collected into a pandas dataframe.

In [6]:

df = pd.read_csv('./movies.csv')
    
df

        user        movie  rate
0     Julian  Martin Eden     5
1     Julian    City Hall     4
2     Julian        Gunda     4
3     Julian    First Cow     1
4     Julian   Collective     3
5      Mason    City Hall     5
6      Mason        Gunda     3
7      Mason    First Cow     2
8     Evelyn    City Hall     5
9     Evelyn      Bacurau     4
10    Evelyn    First Cow     3
11    Evelyn   Collective     4
12  Scarlett  Martin Eden     3
13  Scarlett    City Hall     5
14  Scarlett        Gunda     2
15     Ellie      Bacurau     4
16     Ellie    First Cow     3
17     Ellie   Collective     5

### 2. Show the average ratings for each user and each movie.

In [7]:
# average ratings by user
df.groupby('user').mean()

              rate
user
Ellie     4.000000
Evelyn    4.000000
Julian    3.400000
Mason     3.333333
Scarlett  3.333333

In [8]:
# average ratings by movie
df.groupby('movie').mean()

             rate
movie
Bacurau      4.00
City Hall    4.75
Collective   4.00
First Cow    2.25
Gunda        3.00
Martin Eden  4.00

### 3. Create a new pandas dataframe, with normalized ratings for each user. Again, show the average ratings for each user and each movie.

#### Normalization
$$ x_{new} = \frac{x - x_{min}}{x_{max} - x_{min}} $$

In [9]:

df['normalized_rating'] = (df['rate']-df['rate'].min())/(df['rate'].max()-df['rate'].min())
df

        user        movie  rate  normalized_rating
0     Julian  Martin Eden     5               1.00
1     Julian    City Hall     4               0.75
2     Julian        Gunda     4               0.75
3     Julian    First Cow     1               0.00
4     Julian   Collective     3               0.50
5      Mason    City Hall     5               1.00
6      Mason        Gunda     3               0.50
7      Mason    First Cow     2               0.25
8     Evelyn    City Hall     5               1.00
9     Evelyn      Bacurau     4               0.75
10    Evelyn    First Cow     3               0.50
11    Evelyn   Collective     4               0.75
12  Scarlett  Martin Eden     3               0.50
13  Scarlett    City Hall     5               1.00
14  Scarlett        Gunda     2               0.25
15     Ellie      Bacurau     4               0.75
16     Ellie    First Cow     3               0.50
17     Ellie   Collective     5               1.00

In [10]:
# average ratings by user
df.groupby('user').mean()

              rate  normalized_rating
user
Ellie     4.000000           0.750000
Evelyn    4.000000           0.750000
Julian    3.400000           0.600000
Mason     3.333333           0.583333
Scarlett  3.333333           0.583333

In [11]:
# average ratings by movie
df.groupby('movie').mean()

             rate  normalized_rating
movie
Bacurau      4.00             0.7500
City Hall    4.75             0.9375
Collective   4.00             0.7500
First Cow    2.25             0.3125
Gunda        3.00             0.5000
Martin Eden  4.00             0.7500

### 4. Provide a text-based conclusion: explain what might be advantages and disadvantages of using normalized ratings instead of the actual ratings.

The use of standard classifications allows working with a reduced range of values, which makes it more efficient.
When it comes to measurements that have different units and scales, normalization is very useful for further processing. This is not the case, but it is important to keep it in mind.

A disadvantage could be that it requires prior data processing and preparation.
Another could be if you have outliers in your data set, this scales the data to a very small interval.

### 5. [Extra credit] Create another new pandas dataframe, with standardized ratings for each user. Once again, show the average ratings for each user and each movie.


#### Standardization
$$ x_{new} = \frac{x - \mu}{\sigma} $$

In [12]:

df_2 = pd.read_csv('./movies.csv')
    

df_2['normalized_rating'] = (df_2['rate']-df_2['rate'].mean())/df_2['rate'].std()
df_2

        user        movie  rate  normalized_rating
0     Julian  Martin Eden     5           1.162218
1     Julian    City Hall     4           0.325421
2     Julian        Gunda     4           0.325421
3     Julian    First Cow     1          -2.184969
4     Julian   Collective     3          -0.511376
5      Mason    City Hall     5           1.162218
6      Mason        Gunda     3          -0.511376
7      Mason    First Cow     2          -1.348173
8     Evelyn    City Hall     5           1.162218
9     Evelyn      Bacurau     4           0.325421
10    Evelyn    First Cow     3          -0.511376
11    Evelyn   Collective     4           0.325421
12  Scarlett  Martin Eden     3          -0.511376
13  Scarlett    City Hall     5           1.162218
14  Scarlett        Gunda     2          -1.348173
15     Ellie      Bacurau     4           0.325421
16     Ellie    First Cow     3          -0.511376
17     Ellie   Collective     5           1.162218

In [13]:
# average ratings by user
df_2.groupby('user').mean()

              rate  normalized_rating
user
Ellie     4.000000           0.325421
Evelyn    4.000000           0.325421
Julian    3.400000          -0.176657
Mason     3.333333          -0.232444
Scarlett  3.333333          -0.232444

In [14]:
# average ratings by movie
df_2.groupby('movie').mean()

             rate  normalized_rating
movie
Bacurau      4.00           0.325421
City Hall    4.75           0.953019
Collective   4.00           0.325421
First Cow    2.25          -1.138973
Gunda        3.00          -0.511376
Martin Eden  4.00           0.325421